evgmolt/Tonometer/gd32f303_v1/src/main.c
void FmcFlagsClear(void)
{
    fmc_flag_clear(FMC_FLAG_BANK0_END);
    fmc_flag_clear(FMC_FLAG_BANK0_WPERR);
    fmc_flag_clear(FMC_FLAG_BANK0_PGERR);
}

void FmcErasePage(uint32_t page_address)
{
    /* unlock the flash program/erase controller */
    fmc_unlock();
    /* clear all pending flags */
    FmcFlagsClear();
    /* erase the flash page */
    fmc_page_erase(page_address);
    /* lock the main FMC after the erase operation */
    fmc_lock();
}

void FmcProgramSerial(void)
{
    FmcErasePage(FMC_SERIAL_START_ADDR);  

    uint8_t cur_count=0;
    /* unlock the flash program/erase controller */
    fmc_unlock();

    address = FMC_SERIAL_START_ADDR;

    /* program flash */
    while(address < FMC_SERIAL_END_ADDR)
    {
        fmc_word_program(address, SERIAL[cur_count++]);
        address += 4;
        FmcFlagsClear();
    }

    /* lock the main FMC after the program operation */
    fmc_lock();
}

void FmcProgramRate(uint32_t whole_part, uint32_t fract_part)
{
    FmcErasePage(FMC_RATE_START_ADDR);
    
    /* unlock the flash program/erase controller */
    fmc_unlock();

    address = FMC_RATE_START_ADDR;

    /* program flash */
    fmc_word_program(address, whole_part);
    address += 4;
    FmcFlagsClear();
    fmc_word_program(address, fract_part);
    FmcFlagsClear();

    /* lock the main FMC after the program operation */
    fmc_lock();
}

double ReadRateFromFmc()
{
    uint32_t *ptr;
    ptr = (uint32_t *)FMC_RATE_START_ADDR;
    uint32_t whole = *(ptr);
    uint16_t fract = *(ptr + 1);
    rate_whole = whole;
    rate_fract = fract;
    return (double)(rate_whole + rate_fract / 100);
}

void FmcSerialCheck(void)
{
    uint8_t cur_SERIAL[7]={0};
    uint8_t cur_buff[30]={'A','T','+','N','A','M','E','=','T','O','N','0','2'};

    ptrd = (uint32_t *)FMC_SERIAL_START_ADDR;
        
    if((*ptrd) == '0' & (*(ptrd+1)) == '2')
    {
        SERIAL[2]=cur_SERIAL[0]=*(ptrd+2);    
        SERIAL[3]=cur_SERIAL[1]=*(ptrd+3);
        SERIAL[4]=cur_SERIAL[2]=*(ptrd+4);
        SERIAL[5]=cur_SERIAL[3]=*(ptrd+5);
        SERIAL[6]=cur_SERIAL[4]=*(ptrd+6);
        SERIAL[7]=cur_SERIAL[5]=*(ptrd+7);
        SERIAL[8]=cur_SERIAL[6]=*(ptrd+8);                
    }        
    else
    {
        SERIAL[0]='0';
        SERIAL[1]='2'; 
        SERIAL[2]='0';    cur_SERIAL[0]='0';
        SERIAL[3]='0';    cur_SERIAL[1]='0';
        SERIAL[4]='0';    cur_SERIAL[2]='0';
        SERIAL[5]='0';    cur_SERIAL[3]='0';
        SERIAL[6]='0';    cur_SERIAL[4]='0';
        SERIAL[7]='0';    cur_SERIAL[5]='0';
        SERIAL[8]='0';    cur_SERIAL[6]='0';
        FmcErasePage(FMC_SERIAL_START_ADDR);
        FmcProgramSerial();                
    }        
    strncat(cur_buff,cur_SERIAL,7);
    strncat(cur_buff,"\0\n",2);
    send_buf_UART_0(cur_buff,strlen(cur_buff));
}

void WriteBackupRegister(uint16_t day, uint16_t month, uint16_t year)
{
    BKP_DATA10_41(10) = day;
    BKP_DATA10_41(11) = month;
    BKP_DATA10_41(12) = year;
}

void CheckBackupRegister(uint16_t *_day, uint16_t *_month, uint16_t *_year)
{
    *_day = BKP_DATA_GET(BKP_DATA10_41(10));
    *_month = BKP_DATA_GET(BKP_DATA10_41(11));
    *_year = BKP_DATA_GET(BKP_DATA10_41(12));
}

void SendMeasurementResult(uint8_t c_day, uint8_t c_month, uint8_t c_year, uint8_t c_ss, uint8_t c_mm, uint8_t c_hh, int16_t sis, int16_t dia, int16_t pressure, int16_t bonus)
{
    uint8_t cur_buff[13]={'0','2', 0x01, c_day, c_month, c_year, c_ss, c_mm, c_hh, sis, dia, pressure, bonus};        
    uint8_t c_summ=0;        
    for (int q=0;q<13;q++)
    {
       c_summ+=cur_buff[q];
    }            
    cur_buff[13]=c_summ;
    send_buf_UART_0(cur_buff,14);
}

